CSI API ETABS v1
cDStCanadian_S16_24.SetOverwrite Method
 Sets the value of a steel design overwrite item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDStCanadian_S16_24
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
Item
Type: System.Int32
 This is an integer between 1 and 41, inclusive, indicating the overwrite item considered
Framing type
Consider deflection
Deflection check type
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total-camber limit, L/Value
DL deflection limit, absolute
SDL + LL deflection limit, absolute
LL deflection limit, absolute
Total load deflection limit, absolute
Total-camber limit, absolute
Specified camber
Net area to total area ratio
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor LTB
Unbraced length ratio, Lateral Torsional Buckling
Effective length factor, K Major
Effective length factor, K Minor
Effective length factor, K LTB
Moment coefficient, Omega1 Major
Moment coefficient, Omega1 Minor
Bending coefficient, Omega2
Nonsway moment factor, U1 Major
Nonsway moment factor, U1 Minor
Sway moment factor, U2 Major
Sway moment factor, U2 Minor
Parameter for compressive resistance, n
Yield stress, Fy
Expected to specified Fy ratio, Ry
Compressive resistance, Cr
Tensile resistance, Tr
Major bending resistance, Mr3
Minor bending resistance, Mr2
Major shear resistance, Vr2
Minor shear resistance, Vr3
Demand/capacity ratio limit
Is HSS sections class H
Warping Torsional Constant, Cw
Value
Type: System.Double
 The value of the considered overwrite item
Framing type
0 - As specified in preferences
1 - Type LD MRF
2 - Type MD MRF
3 - Type D MRF
4 - Type LD CBF(V)
5 - Type LD CBF(TC)
6 - Type LD CBF(TO)
7 - Type LD CBF(OT)
8 - Type MD CBF(V)
9 - Type MD CBF(TC)
10 - Type MD CBF(TO)
11 - Type MD CBF(OT)
12 - EBF
13 - Cantilever Column
14 - Conventional MF
15 - Conventional BF
Consider deflection?
0 = No
Any other value = Yes
Deflection check type
0 - Program Determined
1 - Ratio
2 - Absolute
3 - Both
DL deflection limit, L/Value
Value >= 0; 0 means no check for this item
SDL + LL deflection limit, L/Value
Value >= 0; 0 means no check for this item
LL deflection limit, L/Value
Value >= 0; 0 means no check for this item
Total load deflection limit, L/Value
Value >= 0; 0 means no check for this item
Total-camber limit, L/Value
Value >= 0; 0 means no check for this item
DL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
SDL + LL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
LL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
Total load deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
Total-camber limit, absolute
Value >= 0; 0 means no check for this item. [L]
Specified camber
Value >= 0. [L]
Net area to total area ratio
Value >= 0; 0 means use program default value
Live load reduction factor
Value >= 0; 0 means use program determined value
Unbraced length ratio, Major
Value >= 0; 0 means use program determined value
Unbraced length ratio, Minor
Value >= 0; 0 means use program determined value
Unbraced length ratio, Lateral Torsional Buckling
Value >= 0; 0 means use program determined value
Effective length factor, K Major
Value >= 0; 0 means use program determined value
Effective length factor, K Minor
Value >= 0; 0 means use program determined value
Effective length factor, K LTB
Value >= 0; 0 means use program determined value
Moment coefficient, Omega1 Major
Value >= 0; 0 means use program determined value
Moment coefficient, Omega1 Minor
Value >= 0; 0 means use program determined value
Moment coefficient, Omega2
Value >= 0; 0 means use program determined value
Nonsway moment factor, U1 Major
Value >= 0; 0 means use program determined value
Nonsway moment factor, U1 Minor
Value >= 0; 0 means use program determined value
Sway moment factor, U2 Major
Value >= 0; 0 means use program determined value
Sway moment factor, U2 Minor
Value >= 0; 0 means use program determined value
Parameter for compressive resistance, n
Value >= 0; 0 means use program determined value
Yield stress, Fy
Value >= 0; 0 means use program determined value [F/L2]
Expected to specified Fy ratio, Ry
Value >= 0; 0 means use program determined value [F/L2]=
Compressive resistance, Cr
Value >= 0; 0 means use program determined value [F]
Tensile resistance, Tr
Value >= 0; 0 means use program determined value [F]
Major bending resistance, Mr3
Value >= 0; 0 means use program determined value [FL]
Minor bending resistance, Mr2
Value >= 0; 0 means use program determined value [FL]
Major shear resistance, Vr2
Value >= 0; 0 means use program determined value [F]
Minor shear resistance, Vr3
Value >= 0; 0 means use program determined value [F]
Demand/capacity ratio limit
Value >= 0; 0 means use program determined value
Is HSS sections class H?
0 = No
Any other value = Yes
 Warping torsional constant, Cw
 Value >= 0; 0 means use program determined value.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("CSA S16-24")
'set overwrite item
   ret = SapModel.DesignSteel.Canadian_S16_24.SetOverwrite("8", 1, 7)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStCanadian_S16_24 Interface
ETABSv1 Namespace